app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "awf"], ["room_number", 13], ["created_at", "2019-11-24 02:04:11.212416"], ["updated_at", "2019-11-24 02:04:11.212416"]]
---
	def create
		school_class = SchoolClass.create(classes_params)

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 3113], ["updated_at", "2019-11-24 03:01:04.094286"], ["id", 3]]
---
	def update
		school_class = SchoolClass.update(classes_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
		def find_class
			@school_class = SchoolClass.find(params[:id])