app/controllers/students_controller.rb

  def create
    @student = Student.create(student_strong_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "young"], ["last_name", "han"], ["created_at", "2019-11-24 03:12:06.490458"], ["updated_at", "2019-11-24 03:12:06.490458"]]

  def update
    # byebug
    @student.update(student_strong_params(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "hana"], ["updated_at", "2019-11-24 03:27:32.220703"], ["id", 4]]